Repository: geraldloss/glcrossword
Catalog: Resources/Private/Language/*.locallang_csh_flexforms.xlf
Languages: de

# settings.titleOfCrossword.alttitle
source: Titel of the crossword puzzle
de: Titel des Kreuzworträtsels

# settings.titleOfCrossword.description
source: Titel of the crossword puzzle only for internal description. This title doesn't apears on the frontend.
de: Titel des Kreuzworträtsels nur als interne Beschreibung. Dieser Titel wird nicht an der Oberfläche zu sehen sein

# settings.widthOfCrossword.alttitle
source: Width of the crossword puzzle
de: Breite des Kreuzworträtsels

# settings.widthOfCrossword.description
source: Number of fields in width
de: Anzahl an Feldern in der Breite

# settings.widthOfCrossword.details
source: If the crossword should contain 10 fields in width, then write 10 in this field.
de: Wenn das Kreuzworträtsel 10 Felder breit sein soll, dann tragen Sie hier eine 10 ein.

# settings.heightOfCrossword.alttitle
source: Height of the crossword puzzle
de: Höhe des Kreuzworträtsels

# settings.heightOfCrossword.description
source: Number of fields in height
de: Anzahl an Feldern in der Höhe

# settings.heightOfCrossword.details
source: If the crossword should contain 10 fields in height, then write 10 in this field.
de: Wenn das Kreuzworträtsel 10 Felder hoch sein soll, dann tragen Sie hier eine 10 ein.

# settings.relatetQuestions.alttitle
source: Relatet questions of the crossword puzzle
de: Zugehörige Fragen des Kreuzworträtsels

# settings.relatetQuestions.description
source: All questions which are relatet to this crossword. Click hier for full description.
de: Alle Fragen die zu dem Kreuzworträtsel gehören. Klicken Sie hier für eine genaue Beschreibung.

# settings.relatetQuestions.details
source: You have to create in a sysFolder all questions for this crossword. Go in the list view to a sysFolder and create a new item of the type question. Then you can assign this question to this field of the crossword.
de: Sie müssen in einem sysFolder alle Fragen erstellen die zu diesem Kreuzworträtsel gehören sollen. Dazu müssen Sie in der List Ansicht auf ein SysFolder gehen und dort ein Element vom Typ Frage erstellen. Danach können Sie diese Fragen in diesem Feld zuordnen.

# settings.scaleXFactor.alttitle
source: Factor to scale the width of the crossword
de: Faktor um die Breite des Kreuzworträtsels zu skalieren.

# settings.scaleXFactor.description
source: Write 2 to double the width or 0.5 to shrink to half.
de: Schreiben Sie 2, um das Kreuzworträtsel in der Breite zu verdoppeln oder 0.5, um es zu halbieren

# settings.scaleYFactor.alttitle
source: Factor to scale the height of the crossword
de: Faktor um die Höhe des Kreuzworträtsels zu skalieren.

# settings.scaleYFactor.description
source: Write 2 to double the height or 0.5 to shrink to half.
de: Schreiben Sie 2, um das Kreuzworträtsel in der Höhe zu verdoppeln oder 0.5, um es zu halbieren

# settings.borderWidth.alttitle
source: Border width of the crossword boxes in pixel
de: Rahmendicke der einzelnen Kästchen in Pixel

# settings.cssFile.alttitle
source: Alternative CSS file with individual layout configuration for the crossword. Look at the long description.
de: Alternative CSS Datei für ein eigenes Kreuzworträtsel Layout. Siehe Langtext.

# settings.cssFile.description
source: Click here to see the long text.
de: Klicken Sie hier um sich den Langtext anzeigen zu lassen.

# settings.cssFile.details
source: If you like to create your own layout for the crossword, then copy the file glcrossword.css from the folder /typo3conf/ext/glcrossword/css/ in any place under /fileadmin/ and customize it for your own needs. Never alter the name of the classes. Only the content of the classes is allowed for changings. Then describe the path to this file from the fileadmin-folder in this field. For instance if you have place your own css file in the folder /fileadmin/myHomepage/myowncrossword.css then you have to write myHomepage/myowncrossword.css into this field. If you leave it empty, then this plugin use the default css file. Should you try to set more then one crossword on one page, then you need to place in every crossword the same alternate CSS file. Otherwise would win alway the css file of the last crossword.
de: Wenn Sie vorhaben das Layout des Kreuzworträtsels Ihren eigenen Vorstellungen anzupassen, dann kopieren sie die Datei glcrossword.css aus dem Verzeichnis /typo3conf/ext/glcrossword/css/ in irgend einen Ort unterhalb von /fileadmin/ und passen Sie diese Ihren Bedürfnissen an. Achtung! Niemals die Namen der Klassen ändern. Nur das Ändern der Inhalte der Klassen ist erlaubt. Danach können Sie den Pfad vom fileadmin-Verzeichnis aus in diesem Feld eintragen. Z. B. wenn Sie eine eigenen CSS-Datei im Verzeichnis /fileadmin/myHomepage/myowncrossword.css abgelegt haben, dann schreiben Sie myHomepage/myowncrossword.css in dieses Feld. Wenn Sie dieses Feld leer lassen, dann wird wieder die Standard CSS-Datei gezogen. Sollten Sie mehrere Kreuzworträtsel auf eine Seite setzen, dann müssen Sie überall die selbe alternative CSS-Datei einsetzen. Ansonsten würde immer die CSS-Datei des letzten Rätsels gewinnen.

# settings.darkCssFile.alttitle
source: Include css file for dark color scheme, if you like to support "color-scheme: dark" of the browser.
de: Einfügen der css-Datei mit einem dunklen Farbschema, wenn du Browser mit "color-scheme: dark" unterstützen willst.

# settings.darkCssFile.description
source: Modern Browsers support the meta tag 'meta name="color-scheme" content="light dark"' With that settings you can support two different color schemes in one page. If you like to support dark and light color schemes, you should activate this option.
de: ![CDATA[ Moderne Browser unterstützen das Meta Tag 'meta name="color-scheme" content="light dark"', womit man zwei unterschiedliche Farbschemen in einer Homepage unterstützen kann. Wenn du dunkle und helle Farbschemen unterstützen willst, dann sollte diese Option aktiviert werden.]]
