Repository: geraldloss/glcrossword
Catalog: Resources/Private/Language/*.locallang_csh.xlf
Languages: de

# question.alttitle
source: Questiontext
de: Fragetext

# question.description
source: This field contains the text of the question.
de: Dieses Feld beinhaltet den Fragetext.

# answer.alttitle
source: Answertext
de: Antworttext

# answer.description
source: This field contains the text of the answer.
de: Dieses Feld beinhaltet den Antworttext.

# mask.alttitle
source: Edit mask for the answer
de: Schreibmaske für die Antwort

# mask.description
source: Configure if some letters should come together in one field. Click here for more details.
de: Steuert wie viele Buchstaben in ein Feld bei der Antwort kommen. Klicken Sie hier für eine genau Beschreibung.

# mask.details
source: You can for every field describe how many letter it should contain. For instance if the first 3 field should contain only one letter and the fourth field should contain 2 letters, then you have to write 1112 into this field. If all fields after the fourth field contain only one letter again, then you can omit this in the mask. If all fields contain only one field, then left the mask empty
de: Hier kann definiert werden wieviele Buchstaben in ein Feld bei einer Antwort kommen sollen. Wenn zum Beispiel die ersten drei Buchstaben in jeweils ein Feld der Lösungsmaske kommen und in das vierte Feld zwei Buchstaben kommen sollen, dann muss in die Schreibmaske 1112 geschrieben werden. Wenn nach dem vierten Feld in alle Felder nur ein Buchstabe kommen soll, dann können diese in der Schreibmaske weggelassen werden. Soll für die gesamte Antwort jeweils in ein Feld ein Buchstabe kommen, dann kann die Schreibmaske ganz leer gelassen werden.

# mask.syntax
source: If the answer ist weather and you want th in one field then write 1112111 or 1112
de: Wenn die Antwort "wischen" heißt und "sch" in ein Feld soll, dann muss die schreibmaske 11311 oder 113 lauten.

# xpos.alttitle
source: X position of the question
de: X Position der Frage

# xpos.description
source: Column of the position of the question. If the question is in colomn 3 and row 5 locatet, then you have to enter 3. Column 1 and Row 1 is located in the upper left corner
de: Spalte wo die Frage im Kreuzworträtsel stehen soll. Wenn z. B. die Frage in der 3. Spalte auf der 5. Zeile stehen soll, dann muss hier eine 3 rein. Spalte 1 und Zeile 1 liegen in der linken oberen Ecke.

# ypos.alttitle
source: Y position of the question
de: Y Position der Frage

# ypos.description
source: Row of the position of the question. If the question is in colomn 3 and row 5 locatet, then you have to enter 5. Column 1 and Row 1 is located in the upper left corner
de: Zeile wo die Frage im Kreuzworträtsel stehen soll. Wenn z. B. die Frage in der 3. Spalte auf der 5. Zeile stehen soll, dann muss hier eine 5 rein. Spalte 1 und Zeile 1 liegen in der linken oberen Ecke.

# direction.alttitle
source: Direction for the answer.
de: Richtung in die die Antwort hinführen soll.

# direction.description
source: Direction for the answser. If the answer should lead from the top of the question to the right, then choose "Top to the right".
de: Wenn z. B. Die Antwort von dem Kästchen mit der Frage darüber und dann nach rechts gehen soll, dann müssen Sie hier "Oben nach rechts" auswählen.
