Repository: geraldloss/glcrossword
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tt_content.list_type_pi1
source: Crossword
de: Kreuzworträtsel

# tx_glcrossword_questions
source: Questions
de: Fragen

# tx_glcrossword_questions.question
source: Question
de: Frage

# tx_glcrossword_questions.answer
source: Answer
de: Antwort

# tx_glcrossword_questions.mask
source: Mask
de: Maske

# tx_glcrossword_questions.xpos
source: X position in crossword
de: X Position im Kreuzworträtsel

# tx_glcrossword_questions.ypos
source: Y position in crossword
de: Y Position im Kreuzworträtsel

# tx_glcrossword_questions.direction.I.0
source: Top to the left
de: Oben nach links

# tx_glcrossword_questions.direction.I.1
source: To the top
de: Nach oben

# tx_glcrossword_questions.direction.I.2
source: Top to the right
de: Oben nach rechts

# tx_glcrossword_questions.direction.I.3
source: Right to the top
de: Rechts nach oben

# tx_glcrossword_questions.direction.I.4
source: To the right
de: Nach rechts

# tx_glcrossword_questions.direction.I.5
source: Right to the bottom
de: Rechts nach unten

# tx_glcrossword_questions.direction.I.6
source: Down to the rigth
de: Unten nach rechts

# tx_glcrossword_questions.direction.I.7
source: To the bottom
de: Nach unten

# tx_glcrossword_questions.direction.I.8
source: Down to the left
de: Unten nach links

# tx_glcrossword_questions.direction.I.9
source: Left to the bottom
de: Links nach unten

# tx_glcrossword_questions.direction.I.10
source: To the left
de: Nach links

# tx_glcrossword_questions.direction.I.11
source: Left to the top
de: Links nach oben

# tx_glcrossword_questions.direction
source: Direction of the answer
de: Richtung der Antwort
