Repository: geraldloss/glcrossword
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# code.error.double.question
source: There are two questions in this box with the same direction. Theres ist the question "%s" with the UID %u and there is the question "%s" with the UID %u.
de: Es gibt zwei Fragen in disem Kästchen mit der selben Richtung. Zum einen ist das die Frage "%s" mit der UID %u und zum anderen die Frage "%s" mit der UID %u.

# code.error.double.answerletter
source: There are two different letters in this field. From question "%s" with UID %u comes letter "%s" and from question "%s" with UID %u comes letter "%s".
de: Es gibt zwei verschiedene Buchstaben in diesem Feld. Von Frage "%s" mit der UID %u wird Buchstabe "%s" verlangt und von Frage "%s" mit UID %u wird Buchstabe "%s" verlangt.

# code.error.box.type.mismatch
source: In this field is a box of type %s causing of question %s with UID %u and a box of type %s causing of question %s with UID %u at the same time.
de: In diesem Feld muss ein Kästchen vom Typ %s verursacht durch Frage %s mit UID %u und ein Kästchen vom Typ %s verursacht durch Frage %s mit UID %u zur selben Zeit sein.

# code.error.answer.box.out.of.bounds
source: The answer of the question "%s" with the UID %u and a length of %u reaches out of the bounds of the crossword.
de: Die Antwort von der Frage "%s" mit der UID %u und einer Länge von %u ragt über die Grenzen dieses Kreuzworträtsels raus.

# code.error.question.box.out.of.bounds
source: The question "%s" with the UID %u has the x/y coordiante %d and %d and is out of the bounds of the crossword.
de: Die Frage "%s" mit der UID %u hat die x/y Koordinaten %d und %d und ist damit außerhalb der Grenzen dieses Kreuzworträtsels.

# code.error.empty.box.out.of.bounds
source: The empty box with the x/y coordiante %d and %d is out of the bounds of this crossword. This is an error in the source code. Please contact the developer.
de: Das leere Kästchen mit den x/y Koordinaten %d und %d liegt außerhalb der Grenzen dieses Kreuzworträtsels. Die Ursache liegt im Quellcode. Bitte kontaktieren Sie den Entwickler.

# code.error.general.dialog
source: There are errors in the setup of the crossword. For further information move the mouse over the highlighted field and correct this errors.
de: Es sind Fehler beim Kreuzworträtsel Setup aufgetreten. Für genauere Hinweise gehen Sie mit dem Mousecursor über die hervorgehobenen Felder und korrigieren Sie diese Fehler.

# code.error.wrong.answer
source: Your answer was:
de: Ihre Antwort war:

# text.button.solution
source: Solution
de: Auflösen

# text.button.hint
source: Hint
de: Tipp

# text.button.hint.description
source: Click on an answer box to get a hint
de: Klicken Sie auf ein Antwortfeld, um einen Hinweis zu erhalten.

# text.hourglass.waiting
source: Waiting for data...
de: Warten auf Daten...

# pi1_title
source: Crossword
de: Kreuzworträtsel

# pi1_plus_wiz_description
source: Adds a new crossword puzzle
de: Neues Kreuzworträtsel hinzufügen

# flexform.plugin.general.sheet_title
source: Basic configurations
de: Grundeinstellungen

# flexform.plugin.general.crossword_title
source: Titel of the crossword puzzle
de: Titel des Kreuzworträtsels

# flexform.plugin.general.width
source: Width
de: Breite

# flexform.plugin.general.height
source: Height
de: Höhe

# flexform.plugin.general.scale_xfactor
source: Factor to scale the width
de: Faktor um die Breite zu saklieren

# flexform.plugin.general.scale_yfactor
source: Factor to scale the height
de: Faktor um die Höhe zu saklieren

# flexform.plugin.general.border_width
source: Border width
de: Rahmendicke

# flexform.plugin.general.css.file
source: Alternative CSS file
de: Alternative CSS Datei

# flexform.plugin.general.darkcss.file
source: CSS file for dark color scheme
de: CSS Datei für dunkles Farbschema

# flexform.plugin.general.bootstrap.css
source: Deactivate Bootstrap CSS file
de: Deaktiviere Bootstrap CSS-Datei

# flexform.plugin.general.bootstrap.js
source: Deactivate Bootstrap JS file
de: Deaktiviere Bootstrap JS-Datei

# flexform.plugin.general.jQuery
source: Deactivate jQuery library
de: Deaktiviere jQuery Bibliothek

# flexform.plugin.questions.sheet_title
source: Questions
de: Fragen

# flexform.plugin.questions.questions
source: Select the relatet questions
de: Wählen Sie die zugehörigen Fragen aus

# flexform.plugin.name
source: Crossword
de: Kreuzworträtsel

# glcrossword.subcategory.libraries
source: Libraries
de: Bibliotheken

# glcrossword.subcategory.css
source: CSS Settings
de: CSS Einstellungen

# glcrossword.constants.inlcudeJQuery
source: Include the jQuery library with this extension. Deactivate if you have your own jQuery library. Be aware, that you need jQeury 3.x
de: Füge die jQuery Bibliothek durch diese Extension ein. Deaktiviere dieses Einstellung, wenn Sie eine eigene jQuery Bibliothek eingebunden haben. Beachten Sie, dass sie jQuery 3.x benötigen

# glcrossword.constants.includeBootstrapJs
source: Include the Bootstrap javascript library with this extension. Deactivate if you have your own Bootstrap library. Be aware, that you need Bootstrap 3.x
de: Füge die Bootstrap Javascript Bibliothek durch diese Extension ein. Deaktiviere dieses Einstellung, wenn Sie eine eigene Bootstrap Bibliothek eingebunden haben. Beachten Sie, dass sie Bootstrap 3.x benötigen

# glcrossword.constants.includeBootstrapCss
source: Include the Bootstrap CSS content file with this extension. Deactivate if you have your own Bootstrap CSS content file. Be aware, that you need Bootstrap 3.x
de: Füge die Bootstrap CSS-Datei durch diese Extension ein. Deaktiviere dieses Einstellung, wenn Sie eine eigene Bootstrap CSS-Datei eingebunden haben. Beachten Sie, dass sie Bootstrap 3.x benötigen
